<?php

use Illuminate\Database\Seeder;

class PageSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $page = App\Models\Page::create([
                'title' => 'سياسة الخصوصية',
                'slug' => 'policy',
                'body' => '
                            <div><p>إنّ خصوصيتك على الإنترنت أمر في غاية الأهمية بالنسبة لمنظمة الصحة العالمية. ويشرح هذا البيان سياسة المنظمة فيما يتعلق بجمع وتقاسم المعلومات الشخصية التي يدلي بها الزوار على موقع المنظمة. وتلك السياسة تنطبق على "جميع المواقع التابعة للمنظمة"، أي جميع المواقع التي تدخل ضمن اسم المجال التالي: "who.int".</p><h2>ما هي المعلومات التي تجمعها المنظمة؟</h2><h3>الاستخدام العادي للموقع</h3><p>يمكنك، عموماً، تصفّح موقع المنظمة دون أن تكشف عن هويتك أو تدلي بأية معلومات شخصية. والمعلومات الوحيدة التي نجمعها أثناء التصفّح العام للموقع هي المعلومات العامة التي تُجمع في سجلات الخادم العادية. وتشمل تلك المعلومات عنوان بروتوكول الإنترنت(IP) واسم المجال الخاصين بك ونوع برنامج التصفّح ونظام التشغيل اللّذين تستخدمهما، فضلاً عن معلومات أخرى مثل عنوان الموقع الذي نفذت منه إلى موقعنا والملفات التي تحمّلها والصفحات التي تزورها وتواريخ/مواعيد تلك الزيارات.</p><h3>جمع المعلومات الشخصية التي يمكن الكشف عن صاحبها</h3><p>إذا أردت الاشتراك في رسالة إخبارية أو النفاذ إلى بعض من مواقع المنظمة أو طلب كتاب أو التماس معلومات أو الإدلاء بتعليقات أو طلب وظيفة أو المشاركة في مجموعة مناقشة أو الانضمام إلى قائمة بريدية إلكترونية، لا بد لك من تقديم معلومات شخصية، مثل اسمك وعنوانيك البريدي والإلكتروني. ولا يتم جمع تلك المعلومات إلا بعلمك وإذنك، ويتم الاحتفاظ بها في مختلف قواعد البيانات والقوائم البريدية التابعة للمنظمة. وقد يُطلب منك، إذا كنت تريد اقتناء شيء عن طريق الإنترنت، إعطاء تفاصيل بطاقتك الائتمانية. وتتم إحالة تلك التفاصيل إلى إحدى دوائر الدفع الإلكتروني المأمونة التي تضيّف مواقعها خارج نظام المنظمة. ولا تحتفظ المنظمة بالمعلومات الخاصة ببطاقات الائتمان.</p><p>ويجوز لمواقع المنظمة التي تضع شروطاً محدّدة لجمع المعلومات الشخصية أن تنشر سياسات خاصة بها تتعلق بالسرية. وفي تلك الحالات تكون السياسات الخاصة بتلك المواقع فيما يتعلق بالخصوصية مكمّلة للسياسة العامة التي تنتهجها المنظمة في هذا المجال، غير أنّها تتيح تفاصيل إضافية بخصوص تلك المواقع.</p><p>ويؤدي تسجيل معلومات شخصية أو التزويد بها، في بعض المواقع المعيّنة، إلى ظهور ملّف تتبّع المسار*. ويمكن للمنظمة، من خلال ذلك الملف، أن تتذكّر التفاصيل الخاصة بك لدى زيارتك الموقع مرّة أخرى، وبالتالي لن تضطر إلى تقديم المعلومات ذاتها ثانية. وذلك يساعدنا على تزويدك بخدمة أجود.</p><p>وقد يعني الانضمام إلى "مجموعات مناقشة" أنّه بإمكان مشاركين آخرين في المناقشة (بمن فيهم أناس آخرون يعملون في منظمات أخرى غير منظمة الصحة العالمية) الاطلاع على معلوماتك الشخصية التي قدّمتها بمحض إرادتك. وتلك المعلومات ستكون متاحة لجميع أعضاء مجموعات المناقشة المفتوحة.</p><h2>ماذا تفعل المنظمة بالمعلومات التي تجمعها؟</h2><h3>الاستخدام العادي للموقع</h3><p>تُستخدم المعلومات التي تُجمع أثناء تصفّح المجال "who.int" لتحليل الاتجاهات ودرجة استخدام موقع المنظمة ولتحسين نفعيته. وليس لذلك علاقة بأية معلومات شخصية.</p><h3>المعلومات الشخصية التي يمكن الكشف عن صاحبها</h3><p>قد تستخدم المنظمة المعلومات الشخصية التي تقدّمها للأغراض التالية:</p><p>الاتصال بك - سواء للردّ على استفسار طلبته أو اقتراح قدّمته، أو لتزويدك برسائل إخبارية أو وثائق أو مطبوعات أو غير ذلك؛</p><p>إدارة ومعالجة طلبات التوظيف التي تقدّمها؛</p><p>تأكيد عمليات الشراء والتسجيلات التي تقوم بها على الموقع؛</p><p>الحصول على المبالغ اللازمة لتغطية ما تشتريه عبر الموقع (بواسطة بطاقة الائتمان)؛</p><p>"تذكّر" معلوماتك الإلكترونية ومواقعك المفضّلة؛</p><p>مساعدتك على إيجاد المعلومات التي تلزمك بسرعة استناداً إلى مجالات اهتمامك، ومساعدتنا على استحداث محتوى يتجاوب مع رغباتك؛</p><p>التحليل الإحصائي.</p><h2>ما ذا لو قرّرتُ عدم الإدلاء بمعلوماتي الشخصية؟</h2><p>إنّ الإدلاء بمعلومات شخصية على موقع منظمة الصحة العالمية أمر اختياري. فيمكنك، حتى إذا قرّرت عدم الإدلاء بمعلومات شخصية، تصفّح موقع المنظمة واستخدامه، ولكن لن تُتاح لك إمكانية القيام ببعض العمليات، مثل شراء المواد إلكترونياً أو الاشتراك في رسالة إخبارية أو البحث عن وظيفة.</p><h2>سحب معلوماتك الشخصية أو تغييرها</h2><p>يمكنك في أي وقت إلغاء معلوماتك الشخصية أو تغييرها بالرجوع إلى الصفحة الإلكترونية التي أدليت فيها بتلك المعلومات أو الاتصال بالجهة المسؤولة عن تلك الصفحة/إحدى إدارات منظمة الصحة العالمية. وعندما لا تكون تفاصيل الاتصال متاحة على الصفحة يمكنك التماس المزيد من المعلومات عن طريق الاتصال إلكترونياً بالعنوان التالي:<a href="mailto:internet@who.int">internet@who.int</a></p><h2>الأمن</h2><p>إنّ منظمة الصحة العالمية لا تقوم من خلال موقعها ببيع أو إتاحة أية معلومات شخصية يمكن الكشف عن صاحبها لطرف ثالث. ويتم الاحتفاظ بكل المعلومات التي يدلي بها مستخدمو الموقع بعناية قصوى وبضمان أقصى مستوى من مستويات الأمن، ولا يتم استخدامها بطرق غير تلك المبيّنة في هذه السياسة المتعلقة بالخصوصية أو في السياسات المتعلقة بالخصوصية والتابعة لمواقع المنظمة الفرعية، أو بطرق غير تلك التي كنت قد أبديت موافقة صريحة بشأنها. وتستخدم المنظمة طائفة من التكنولوجيات والتدابير الأمنية لحماية المعلومات المحتفظ بها في نُظمها الإلكترونية من الضياع أو سوء الاستخدام أو منع الاطلاع عليها أو الإفصاح عنها أو تعديلها أو إتلافها بطرق غير مرخّص بها.</p><p>وعلى جميع موظفي المنظمة ممّن يمكنهم الوصول إلى المعلومات الشخصية والمساهمة في معالجتها احترام سريّة المعاملات الرسمية التي تتم في الموقع، بما في ذلك المعطيات الشخصية.</p><p>ويحتوي موقع المنظمة على روابط إلى مواقع خارج المجال "who.int". والمنظمة ليست مسؤولة عن محتوى تلك المواقع أو ممارساتها المتعلقة بالخصوصية.</p><h2>الإعلام بالتغييرات</h2><p>يتم الإعلان عن أي تغيير يطرأ على هذه السياسة المتعلقة بالخصوصية في الصفحة الرئيسة لمنظمة الصحة العالمية على الإنترنت وعنوانها<a href="https://www.who.int/">www.who.int</a>.</p><h2>للاتصال بنا</h2><p>إذا كانت لديك أية أسئلة أو استفسارات بشأن هذه السياسة المتعلقة بالخصوصية ، الرجاء الاتصال بنا على العنوان الإلكتروني التالي:&nbsp;<a href="mailto:internet@who.int">internet@who.int</a></p><p>*&nbsp;ملفات تتبّع المسار (Cookies)&nbsp;<br>يُعد ملف تتبّع المسار مجموعة صغيرة من المعطيات يرسلها الحاسوب الخادم إلى جهاز التصفّح الذي تستخدمه. ويُستخدم ذلك الملف، عادة، لتحديد هوية فريدة لحاسوبك وتخزين معلومات من قبيل هوية المستخدم وكلمات السر والمواقع المفضّلة ومعلوماته الإلكترونية. ويُخزّن ذلك الملف في القرص الصلب لحاسوبك. ويمكنك وقف تلقي ملفات تتبّع المسار التي ترسلها المنظمة بإعادة برمجة جهاز التصفّح. كما يمكن أن ترسل مختلف المواقع الإلكترونية ملفات تتبّع المسار الخاصة بها إلى حاسوبك. ولضمان الخصوصية لا يسمح جهاز التصفّح الذي تستخدمه للموقع الإلكتروني إلاّ بالوصول إلى الملفات التي أرسلها هو إليك وليس تلك التي أرسلتها إليك مواقع أخرى.</p></div>
                          ',
                'excerpt' => 'نقدر مخاوفكم واهتمامكم بشأن خصوصية بياناتكم على شبكة الإنترنت.
                لقد تم إعداد هذه السياسة لمساعدتكم في تفهم طبيعة البيانات التي نقوم بتجميعها منكم عند زيارتكم لموقعنا على شبكة الانترنت وكيفية تعاملنا مع هذه البيانات الشخصية. ',
                'publish' => 'publish',
                'visibility' => 'public',
                'comments' => 'notallow',
                'admin_id'=>1,
        ]);

        $page = App\Models\Page::create([
            'title' => 'من نحن',
            'slug' => 'about',
            'body' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربىهذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربىهذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربىهذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربىهذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربىهذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربىهذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربىهذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربىهذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربىهذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى',
            'excerpt' => 'نبذه تعريفيه عن موقعنا',
            'publish' => 'publish',
            'visibility' => 'public',
            'comments' => 'notallow',
            'admin_id'=>1,
        ]);

        
    }
}
